stm32duino/Arduino_Core_STM32/system/Drivers/STM32U5xx_HAL_Driver/Src/stm32u5xx_hal_gfxtim.c
/**
  ******************************************************************************
  * @file    stm32u5xx_hal_gfxtim.c
  * @author  MCD Application Team
  * @brief   This file provides firmware functions to manage the following
  *          functionalities of the Multi-function Digital Filter (GFXTIM)
  *          peripheral:
  *           + Initialization and de-initialization
  *           + Integrated frame and line clock generation
  *           + One absolute frame counter with one compare channel
  *           + Two auto reload relative frame counter
  *           + One line timer with two compare channel
  *           + External Tearing Effect line management & synchronization
  *           + Four programmable event generators with external trigger generation
  *           + One watchdog counter
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
  [..]
    *** Initialization and de-initialization ***
    ============================================
    [..]
      (#) User has first to initialize GFXTIM.
      (#) As prerequisite, fill in the HAL_GFXTIM_MspInit() :
        (++) Enable GFXTIM with __HAL_RCC_GFXTIM_CLK_ENABLE
        (++) Enable the clocks for the used GPIOS with __HAL_RCC_GPIOx_CLK_ENABLE().
        (++) Configure these pins in alternate mode using HAL_GPIO_Init().
        (++) If interrupt mode is used, enable and configure GFXTIM
             interrupt with HAL_NVIC_SetPriority() and HAL_NVIC_EnableIRQ().

    [..]
      (#) User can de-initialize GFXTIM with HAL_GFXTIM_DeInit() function.

    *** generic functions ***
    =========================
    [..]
      (#) HAL_GFXTIM_IRQHandler will be called when GFXTIM interrupt occurs.
      (#) HAL_GFXTIM_ErrorCallback will be called when GFXTIM or ADF error occurs.
      (#) Use HAL_GFXTIM_GetState() to get the current GFXTIM or ADF instance state.
      (#) Use HAL_GFXTIM_GetErrorCode() to get the current GFXTIM or ADF instance error code.



#if defined(GENERATOR_CALLBACKS_REGISTERING_AVAILABLE)
  *** Callback registration ***
  =============================================

  The compilation define  USE_HAL_GFXTIM_REGISTER_CALLBACKS when set to 1
  allows the user to configure dynamically the driver callbacks.
  Use Function @ref HAL_GFXTIM_RegisterCallback() to register an interrupt callback.

  Function @ref HAL_GFXTIM_RegisterCallback() registers following callbacks:
      (+) HAL_GFXTIM_AbsoluteTimer_AFCC1Callback
      (+) HAL_GFXTIM_AbsoluteTimer_AFCOFCallback
      (+) HAL_GFXTIM_AbsoluteTimer_ALCC1Callback
      (+) HAL_GFXTIM_AbsoluteTimer_ALCC2Callback
      (+) HAL_GFXTIM_AbsoluteTimer_ALCOFCallback
      (+) HAL_GFXTIM_RelativeTimer_RFC1RCallback
      (+) HAL_GFXTIM_RelativeTimer_RFC2RCallback
      (+) HAL_GFXTIM_TECallback
      (+) HAL_GFXTIM_EventGenerator_EV1Callback
      (+) HAL_GFXTIM_EventGenerator_EV2Callback
      (+) HAL_GFXTIM_EventGenerator_EV3Callback
      (+) HAL_GFXTIM_EventGenerator_EV4Callback
      (+) HAL_GFXTIM_WatchdogTimer_AlarmCallback
      (+) HAL_GFXTIM_WatchdogTimer_PreAlarmCallback
      (+) MspInitCallback
      (+) MspDeInitCallback
  This function takes as parameters the HAL peripheral handle, the Callback ID
  and a pointer to the user callback function.

  Use function @ref HAL_GFXTIM_UnRegisterCallback() to reset a callback to the default
  weak function.
  @ref HAL_GFXTIM_UnRegisterCallback takes as parameters the HAL peripheral handle,
  and the Callback ID.
  This function resets following callbacks:
      (+) HAL_GFXTIM_AbsoluteTimer_AFCC1Callback
      (+) HAL_GFXTIM_AbsoluteTimer_AFCOFCallback
      (+) HAL_GFXTIM_AbsoluteTimer_ALCC1Callback
      (+) HAL_GFXTIM_AbsoluteTimer_ALCC2Callback
      (+) HAL_GFXTIM_AbsoluteTimer_ALCOFCallback
      (+) HAL_GFXTIM_RelativeTimer_RFC1RCallback
      (+) HAL_GFXTIM_RelativeTimer_RFC2RCallback
      (+) HAL_GFXTIM_TECallback
      (+) HAL_GFXTIM_EventGenerator_EV1Callback
      (+) HAL_GFXTIM_EventGenerator_EV2Callback
      (+) HAL_GFXTIM_EventGenerator_EV3Callback
      (+) HAL_GFXTIM_EventGenerator_EV4Callback
      (+) HAL_GFXTIM_WatchdogTimer_AlarmCallback
      (+) HAL_GFXTIM_WatchdogTimer_PreAlarmCallback
      (+) MspInitCallback
      (+) MspDeInitCallback

  By default, after the HAL_GFXTIM_Init() and when the state is HAL_GFXTIM_STATE_RESET,
  all callbacks are set to the corresponding weak functions:
  examples @ref HAL_GFXTIM_ErrorCallback(), @ref HAL_GFXTIM_CalculateCpltCallback().
  Exception done for MspInit and MspDeInit functions that are
  reset to the legacy weak function in the HAL_GFXTIM_Init()/ @ref HAL_GFXTIM_DeInit() only when
  these callbacks are null (not registered beforehand).
  if not, MspInit or MspDeInit are not null, the HAL_GFXTIM_Init()/ @ref HAL_GFXTIM_DeInit()
  keep and use the user MspInit/MspDeInit callbacks (registered beforehand)

  Callbacks can be registered/unregistered in HAL_GFXTIM_STATE_READY state only.
  Exception done MspInit/MspDeInit that can be registered/unregistered
  in HAL_GFXTIM_STATE_READY or HAL_GFXTIM_STATE_RESET state,
  thus registered (user) MspInit/DeInit callbacks can be used during the Init/DeInit.
  In that case first register the MspInit/MspDeInit user callbacks
  using @ref HAL_GFXTIM_RegisterCallback() before calling @ref HAL_GFXTIM_DeInit()
  or HAL_GFXTIM_Init() function.

  When The compilation define USE_HAL_GFXTIM_REGISTER_CALLBACKS is set to 0 or
  not defined, the callback registration feature is not available and all callbacks
  are set to the corresponding weak functions.
#endif

    @endverbatim
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32u5xx_hal.h"

