stm32duino/Arduino_Core_STM32/system/Drivers/STM32U5xx_HAL_Driver/Src/stm32u5xx_hal_gfxtim.c
  if (hgfxtim == NULL)
  {
    status = HAL_ERROR;
  }
  else if (pCallback == NULL)
  {
    /* Update error code and status */
    hgfxtim->ErrorCode |= GFXTIM_ERROR_INVALID_CALLBACK;
    status = HAL_ERROR;
  }
  else
  {
    if (hgfxtim->State == HAL_GFXTIM_STATE_READY)
    {
      switch (CallbackID)
      {
        case HAL_GFXTIM_AFC_COMPARE1_CB_ID :
          hgfxtim->HAL_GFXTIM_AbsoluteTimer_AFCC1Callback = pCallback;
          break;
        case HAL_GFXTIM_AFC_OVERFLOW_CB_ID :
          hgfxtim->HAL_GFXTIM_AbsoluteTimer_AFCOFCallback = pCallback;
          break;
        case HAL_GFXTIM_ALC_COMPARE1_CB_ID :
          hgfxtim->HAL_GFXTIM_AbsoluteTimer_ALCC1Callback = pCallback;
          break;
        case HAL_GFXTIM_ALC_COMPARE2_CB_ID :
          hgfxtim->HAL_GFXTIM_AbsoluteTimer_ALCC2Callback = pCallback;
          break;
        case HAL_GFXTIM_ALC_OVERFLOW_CB_ID :
          hgfxtim->HAL_GFXTIM_AbsoluteTimer_ALCOFCallback = pCallback;
          break;
        case HAL_GFXTIM_RFC1_RELOAD_CB_ID :
          hgfxtim->HAL_GFXTIM_RelativeTimer_RFC1RCallback = pCallback;
          break;
        case HAL_GFXTIM_RFC2_RELOAD_CB_ID :
          hgfxtim->HAL_GFXTIM_RelativeTimer_RFC2RCallback = pCallback;
          break;
        case HAL_GFXTIM_TE_CB_ID :
          hgfxtim->HAL_GFXTIM_TECallback = pCallback;
          break;
        case HAL_GFXTIM_EVENT1_CB_ID :
          hgfxtim->HAL_GFXTIM_EventGenerator_EV1Callback = pCallback;
          break;
        case HAL_GFXTIM_EVENT2_CB_ID :
          hgfxtim->HAL_GFXTIM_EventGenerator_EV2Callback = pCallback;
          break;
        case HAL_GFXTIM_EVENT3_CB_ID :
          hgfxtim->HAL_GFXTIM_EventGenerator_EV3Callback = pCallback;
          break;
        case HAL_GFXTIM_EVENT4_CB_ID :
          hgfxtim->HAL_GFXTIM_EventGenerator_EV4Callback = pCallback;
          break;
        case HAL_GFXTIM_WDG_ALARM_CB_ID :
          hgfxtim->HAL_GFXTIM_WatchdogTimer_AlarmCallback = pCallback;
          break;
        case HAL_GFXTIM_WDG_PREALARM_CB_ID :
          hgfxtim->HAL_GFXTIM_WatchdogTimer_PreAlarmCallback = pCallback;
          break;
        case HAL_GFXTIM_ERROR_CB_ID :
          hgfxtim->ErrorCallback = pCallback;
          break;
        case HAL_GFXTIM_MSP_INIT_CB_ID :
          hgfxtim->MspInitCallback = pCallback;
          break;
        case HAL_GFXTIM_MSP_DEINIT_CB_ID :
          hgfxtim->MspDeInitCallback = pCallback;
          break;
        default :
          /* Update error code and status */
          hgfxtim->ErrorCode |= GFXTIM_ERROR_INVALID_CALLBACK;
          status = HAL_ERROR;
          break;
      }
    }
    else if (hgfxtim->State == HAL_GFXTIM_STATE_RESET)
    {
      switch (CallbackID)
      {
        case HAL_GFXTIM_MSP_INIT_CB_ID :
          hgfxtim->MspInitCallback = pCallback;
          break;
        case HAL_GFXTIM_MSP_DEINIT_CB_ID :
          hgfxtim->MspDeInitCallback = pCallback;
          break;
        default :
          /* Update error code and status */
          hgfxtim->ErrorCode |= GFXTIM_ERROR_INVALID_CALLBACK;
          status = HAL_ERROR;
          break;
      }
    }
    else
    {
      /* Update error code and status */
      hgfxtim->ErrorCode |= GFXTIM_ERROR_INVALID_CALLBACK;
      status = HAL_ERROR;
    }
  }

  return status;
}

/**
  * @brief  Unregister a user GFXTIM callback.
  *         GFXTIM callback is redirected to the weak predefined callback.
  * @param  hgfxtim GFXTIM handle.
  * @param  CallbackID ID of the callback to be unregistered.
  *         This parameter can be one of the following values:
  *           @arg @ref HAL_GFXTIM_AFC_COMPARE1_CB_ID   Absolute frame counter compare 1 callback ID
  *           @arg @ref HAL_GFXTIM_AFC_OVERFLOW_CB_ID   Absolute frame counter overflow callback ID
  *           @arg @ref HAL_GFXTIM_ALC_COMPARE1_CB_ID   Absolute line counter compare 1 callback ID
  *           @arg @ref HAL_GFXTIM_ALC_COMPARE2_CB_ID   Absolute line counter compare 2 callback ID
  *           @arg @ref HAL_GFXTIM_ALC_OVERFLOW_CB_ID   Absolute line counter overflow callback ID
  *           @arg @ref HAL_GFXTIM_RFC1_RELOAD_CB_ID    Relative frame counter 1 reload callback ID
  *           @arg @ref HAL_GFXTIM_RFC2_RELOAD_CB_ID    Relative frame counter 2 reload callback ID
  *           @arg @ref HAL_GFXTIM_TE_CB_ID             External tearing effect callback ID
  *           @arg @ref HAL_GFXTIM_EVENT1_CB_ID         Event events 1 callback ID
  *           @arg @ref HAL_GFXTIM_EVENT2_CB_ID         Event events 2 callback ID
  *           @arg @ref HAL_GFXTIM_EVENT3_CB_ID         Event events 3 callback ID
  *           @arg @ref HAL_GFXTIM_EVENT4_CB_ID         Event events 4 callback ID
  *           @arg @ref HAL_GFXTIM_WDG_ALARM_CB_ID      Watchdog alarm callback ID
  *           @arg @ref HAL_GFXTIM_WDG_PREALARM_CB_ID   Watchdog pre alarm callback ID
  *           @arg @ref HAL_GFXTIM_ERROR_CB_ID          error callback ID
  *           @arg @ref HAL_GFXTIM_MSP_INIT_CB_ID       MSP initialization user callback ID
  *           @arg @ref HAL_GFXTIM_MSP_DEINIT_CB_ID     MSP de-initialization user callback ID
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_UnRegisterCallback(GFXTIM_HandleTypeDef *hgfxtim,
                                                HAL_GFXTIM_CallbackIDTypeDef CallbackID)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (hgfxtim == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    if (hgfxtim->State == HAL_GFXTIM_STATE_READY)
    {
      switch (CallbackID)
      {
        case HAL_GFXTIM_AFC_COMPARE1_CB_ID :
          hgfxtim->HAL_GFXTIM_AbsoluteTimer_AFCC1Callback = HAL_GFXTIM_AbsoluteTimer_AFCC1Callback;
          break;
        case HAL_GFXTIM_AFC_OVERFLOW_CB_ID :
          hgfxtim->HAL_GFXTIM_AbsoluteTimer_AFCOFCallback = HAL_GFXTIM_AbsoluteTimer_AFCOFCallback;
          break;
        case HAL_GFXTIM_ALC_COMPARE1_CB_ID :
          hgfxtim->HAL_GFXTIM_AbsoluteTimer_ALCC1Callback = HAL_GFXTIM_AbsoluteTimer_ALCC1Callback;
          break;
        case HAL_GFXTIM_ALC_COMPARE2_CB_ID :
          hgfxtim->HAL_GFXTIM_AbsoluteTimer_ALCC2Callback = HAL_GFXTIM_AbsoluteTimer_ALCC2Callback;
          break;
        case HAL_GFXTIM_ALC_OVERFLOW_CB_ID :
          hgfxtim->HAL_GFXTIM_AbsoluteTimer_ALCOFCallback = HAL_GFXTIM_AbsoluteTimer_ALCOFCallback;
          break;
        case HAL_GFXTIM_RFC1_RELOAD_CB_ID :
          hgfxtim->HAL_GFXTIM_RelativeTimer_RFC1RCallback = HAL_GFXTIM_RelativeTimer_RFC1RCallback;
          break;
        case HAL_GFXTIM_RFC2_RELOAD_CB_ID :
          hgfxtim->HAL_GFXTIM_RelativeTimer_RFC2RCallback = HAL_GFXTIM_RelativeTimer_RFC2RCallback;
          break;
        case HAL_GFXTIM_TE_CB_ID :
          hgfxtim->HAL_GFXTIM_TECallback = HAL_GFXTIM_TECallback;
          break;
        case HAL_GFXTIM_EVENT1_CB_ID :
          hgfxtim->HAL_GFXTIM_EventGenerator_EV1Callback = HAL_GFXTIM_EventGenerator_EV1Callback;
          break;
        case HAL_GFXTIM_EVENT2_CB_ID :
          hgfxtim->HAL_GFXTIM_EventGenerator_EV2Callback = HAL_GFXTIM_EventGenerator_EV2Callback;
          break;
        case HAL_GFXTIM_EVENT3_CB_ID :
          hgfxtim->HAL_GFXTIM_EventGenerator_EV3Callback = HAL_GFXTIM_EventGenerator_EV3Callback;
          break;
        case HAL_GFXTIM_EVENT4_CB_ID :
          hgfxtim->HAL_GFXTIM_EventGenerator_EV4Callback = HAL_GFXTIM_EventGenerator_EV4Callback;
          break;
        case HAL_GFXTIM_WDG_ALARM_CB_ID :
          hgfxtim->HAL_GFXTIM_WatchdogTimer_AlarmCallback = HAL_GFXTIM_WatchdogTimer_AlarmCallback;
          break;
        case HAL_GFXTIM_WDG_PREALARM_CB_ID :
          hgfxtim->HAL_GFXTIM_WatchdogTimer_PreAlarmCallback = HAL_GFXTIM_WatchdogTimer_PreAlarmCallback;
          break;
        case HAL_GFXTIM_ERROR_CB_ID :
          hgfxtim->ErrorCallback = HAL_GFXTIM_ErrorCallback;
          break;
        case HAL_GFXTIM_MSP_INIT_CB_ID :
          hgfxtim->MspInitCallback = HAL_GFXTIM_MspInit;
          break;
        case HAL_GFXTIM_MSP_DEINIT_CB_ID :
          hgfxtim->MspDeInitCallback = HAL_GFXTIM_MspDeInit;
          break;
        default :
          /* Update error code and status */
          hgfxtim->ErrorCode |= GFXTIM_ERROR_INVALID_CALLBACK;
          status = HAL_ERROR;
          break;
      }
    }
    else if (hgfxtim->State == HAL_GFXTIM_STATE_RESET)
    {
      switch (CallbackID)
      {
        case HAL_GFXTIM_MSP_INIT_CB_ID :
          hgfxtim->MspInitCallback = HAL_GFXTIM_MspInit;
          break;
        case HAL_GFXTIM_MSP_DEINIT_CB_ID :
          hgfxtim->MspDeInitCallback = HAL_GFXTIM_MspDeInit;
          break;
        default :
          /* Update error code and status */
          hgfxtim->ErrorCode |= GFXTIM_ERROR_INVALID_CALLBACK;
          status = HAL_ERROR;
          break;
      }
    }
    else
    {
      /* Update error code and status */
      hgfxtim->ErrorCode |= GFXTIM_ERROR_INVALID_CALLBACK;
      status = HAL_ERROR;
    }
  }

