stm32duino/Arduino_Core_STM32/system/Drivers/STM32U5xx_HAL_Driver/Src/stm32u5xx_hal_gfxtim.c
  return status;
}
#endif /* #if (USE_HAL_GFXTIM_REGISTER_CALLBACKS == 1) */

/**
  * @}
  */

/** @defgroup GFXTIM_Exported_Functions_Group2  Clock Generator functions
  * @brief    Clock Generator functions
  *
@verbatim
  ==============================================================================
                        ##### Clock Generator functions #####
  ==============================================================================
    [..]  This section provides functions allowing to :
      (+) Configure the clock generator.
      (+) Force reload of FCC and LCC.

@endverbatim
  * @{
  */

/**
  * @brief  This function configures the clock generator.
  * @param  hgfxtim GFXTIM handle.
  * @param  pClockGeneratorConfig Clock Generator configuration parameters.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_ClockGenerator_Config(GFXTIM_HandleTypeDef *hgfxtim,
                                                   const GFXTIM_ClockGeneratorConfigTypeDef *pClockGeneratorConfig)
{
  HAL_StatusTypeDef status = HAL_OK;

  if ((hgfxtim == NULL) || (pClockGeneratorConfig == NULL))
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameters */
    assert_param(IS_GFXTIM_ALL_INSTANCE(hgfxtim->Instance));
    assert_param(IS_GFXTIM_LCC_HW_RELOAD_SRC(pClockGeneratorConfig->LCCHwReloadSrc));
    assert_param(IS_GFXTIM_LCC_RELOAD_VALUE(pClockGeneratorConfig->LCCReloadValue));
    assert_param(IS_GFXTIM_LCC_CLK_SRC(pClockGeneratorConfig->LCCClockSrc));
    assert_param(IS_GFXTIM_LINE_CLK_SRC(pClockGeneratorConfig->LineClockSrc));
    assert_param(IS_GFXTIM_FCC_HW_RELOAD_SRC(pClockGeneratorConfig->FCCHwReloadSrc));
    assert_param(IS_GFXTIM_FCC_RELOAD_VALUE(pClockGeneratorConfig->FCCReloadValue));
    assert_param(IS_GFXTIM_FCC_CLK_SRC(pClockGeneratorConfig->FCCClockSrc));
    assert_param(IS_GFXTIM_FRAME_CLK_SRC(pClockGeneratorConfig->FrameClockSrc));
    assert_param(IS_GFXTIM_LINE_CLK_CALIB(pClockGeneratorConfig->LineClockCalib));
    assert_param(IS_GFXTIM_FRAME_CLK_CALIB(pClockGeneratorConfig->FrameClockCalib));

    if (hgfxtim->State == HAL_GFXTIM_STATE_READY)
    {
      /* Disable FCC and LCC */
      CLEAR_BIT(hgfxtim->Instance->CGCR,
                GFXTIM_CGCR_LCCCS | GFXTIM_CGCR_FCCCS);

      /* Set Line Clock Counter (LCC) reload value (22 bits) */
      MODIFY_REG(hgfxtim->Instance->LCCRR, GFXTIM_LCCRR_RELOAD,
                 (pClockGeneratorConfig->LCCReloadValue << GFXTIM_LCCRR_RELOAD_Pos));

      /* Set Frame Clock Counter (FCC) reload value (12 bits) */
      MODIFY_REG(hgfxtim->Instance->FCCRR, GFXTIM_FCCRR_RELOAD,
                 (pClockGeneratorConfig->FCCReloadValue << GFXTIM_FCCRR_RELOAD_Pos));

      /* Set line and frame config */
      MODIFY_REG(hgfxtim->Instance->CGCR,
                 GFXTIM_CGCR_LCCHRS | GFXTIM_CGCR_LCCCS | GFXTIM_CGCR_LCS |
                 GFXTIM_CGCR_FCCHRS | GFXTIM_CGCR_FCCCS | GFXTIM_CGCR_FCS,
                 pClockGeneratorConfig->LCCHwReloadSrc | pClockGeneratorConfig->LCCClockSrc |
                 pClockGeneratorConfig->LineClockSrc | pClockGeneratorConfig->FCCHwReloadSrc |
                 pClockGeneratorConfig->FCCClockSrc | pClockGeneratorConfig->FrameClockSrc);

      /* Set Tearing Effect (TE) , synchronization signals sources (HSYNC and VSYNC) and debug output config */
      MODIFY_REG(hgfxtim->Instance->CR,
                 GFXTIM_CR_LCCOE | GFXTIM_CR_FCCOE,
                 pClockGeneratorConfig->LineClockCalib | pClockGeneratorConfig->FrameClockCalib);
    }
    else
    {
      status = HAL_ERROR;
    }
  }

  return status;
}

/**
  * @brief  This function force clock generator counter(s) reload
  * @param  hgfxtim GFXTIM handle.
  * @param  ClockGeneratorCounter Clock Generator counter
  *          This parameter can be a value of @ref GFXTIM_ClockGeneratorCounter.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_ClockGenerator_Reload(GFXTIM_HandleTypeDef *hgfxtim, uint32_t ClockGeneratorCounter)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (hgfxtim == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameters */
    assert_param(IS_GFXTIM_ALL_INSTANCE(hgfxtim->Instance));
    assert_param(IS_GFXTIM_CLOCK_GENERATOR_COUNTER(ClockGeneratorCounter));


    if (hgfxtim->State == HAL_GFXTIM_STATE_READY)
    {
      SET_BIT(hgfxtim->Instance->CGCR, ClockGeneratorCounter);
    }
    else
    {
      status = HAL_ERROR;
    }
  }

  return status;
}


/**
  * @brief  GFXTIM Tearing effect callback.
  * @param  hgfxtim GFXTIM handle.
  * @retval None.
  */
__weak void HAL_GFXTIM_TECallback(GFXTIM_HandleTypeDef *hgfxtim)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hgfxtim);

  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_GFXTIM_TECallback could be implemented in the user file */
}

/**
  * @}
  */

/** @defgroup GFXTIM_Exported_Functions_Group3 Absolute Timer functions
  * @brief    Absolute Timer functions
  *
@verbatim
  ==============================================================================
                        ##### Absolute Timers functions #####
  ==============================================================================
    [..]  This section provides functions allowing to :
      (+) Configure the absolute timer.
      (+) Start the absolute timer.
      (+) Stop the absolute timer.
      (+) Reset the absolute timer counters.
      (+) Get the absolute time value.
      (+) Set the absolute frame compare value.
      (+) Set the absolute line compare value.
@endverbatim
  * @{
  */

/**
  * @brief  This function configures an absolute Timer.
  * @param  hgfxtim GFXTIM handle.
  * @param  pAbsoluteTimerConfig pointer to a GFXTIM_AbsoluteTimerConfigTypeDef structure that
  *         contains absoluite timer comparators and counters values.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_AbsoluteTimer_Config(GFXTIM_HandleTypeDef *hgfxtim,
                                                  const GFXTIM_AbsoluteTimerConfigTypeDef *pAbsoluteTimerConfig)
{
  HAL_StatusTypeDef status = HAL_OK;

  if ((hgfxtim == NULL) || (pAbsoluteTimerConfig == NULL))
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameters */
    assert_param(IS_GFXTIM_ALL_INSTANCE(hgfxtim->Instance));
    assert_param(IS_GFXTIM_ABSOLUTE_FRAME_VALUE(pAbsoluteTimerConfig->FrameCompare1Value));
    assert_param(IS_GFXTIM_ABSOLUTE_FRAME_VALUE(pAbsoluteTimerConfig->FrameCounterValue));
    assert_param(IS_GFXTIM_INTERRUPT(pAbsoluteTimerConfig->FrameOverflowInterrupt));
    assert_param(IS_GFXTIM_INTERRUPT(pAbsoluteTimerConfig->FrameCompare1Interrupt));
    assert_param(IS_GFXTIM_ABSOLUTE_LINE_VALUE(pAbsoluteTimerConfig->LineCompare1Value));
    assert_param(IS_GFXTIM_ABSOLUTE_LINE_VALUE(pAbsoluteTimerConfig->LineCompare2Value));
    assert_param(IS_GFXTIM_ABSOLUTE_LINE_VALUE(pAbsoluteTimerConfig->LineCounterValue));
    assert_param(IS_GFXTIM_INTERRUPT(pAbsoluteTimerConfig->LineOverflowInterrupt));
    assert_param(IS_GFXTIM_INTERRUPT(pAbsoluteTimerConfig->LineCompare1Interrupt));
    assert_param(IS_GFXTIM_INTERRUPT(pAbsoluteTimerConfig->LineCompare2Interrupt));

