stm32duino/Arduino_Core_STM32/system/Drivers/STM32U5xx_HAL_Driver/Src/stm32u5xx_hal_gfxtim.c
  if (hgfxtim == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameters */
    assert_param(IS_GFXTIM_ALL_INSTANCE(hgfxtim->Instance));
    assert_param(IS_GFXTIM_ABSOLUTE_LINE_COMPARATOR(AbsoluteLineComparator));
    assert_param(IS_GFXTIM_ABSOLUTE_LINE_VALUE(Value));

    if (hgfxtim->State == HAL_GFXTIM_STATE_READY)
    {
      switch (AbsoluteLineComparator)
      {
      case GFXTIM_ABSOLUTE_LINE_COMPARE1:
        WRITE_REG(hgfxtim->Instance->ALCC1R, Value);
        break;
        default:
        /* GFXTIM_ABSOLUTE_LINE_COMPARE2 */
        WRITE_REG(hgfxtim->Instance->ALCC2R, Value);
        break;
      }
    }
    else
    {
      status = HAL_ERROR;
    }
  }
  return status;
}

/**
  * @brief  GFXTIM Absolute frame counter overflow callback.
  * @param  hgfxtim GFXTIM handle.
  * @retval None.
  */
__weak void HAL_GFXTIM_AbsoluteTimer_AFCOFCallback(GFXTIM_HandleTypeDef *hgfxtim)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hgfxtim);
  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_GFXTIM_AbsoluteTimer_AFCOFCallback could be implemented in the user file */
}

/**
  * @brief  GFXTIM Absolute frame counter compare 1 callback.
  * @param  hgfxtim GFXTIM handle.
  * @retval None.
  */
__weak void HAL_GFXTIM_AbsoluteTimer_AFCC1Callback(GFXTIM_HandleTypeDef *hgfxtim)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hgfxtim);
  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_GFXTIM_AbsoluteTimer_AFCC1Callback could be implemented in the user file */
}

/**
  * @brief  GFXTIM Absolute line counter compare 1 callback.
  * @param  hgfxtim GFXTIM handle.
  * @retval None.
  */
__weak void HAL_GFXTIM_AbsoluteTimer_ALCC1Callback(GFXTIM_HandleTypeDef *hgfxtim)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hgfxtim);
  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_GFXTIM_AbsoluteTimer_ALCC1Callback could be implemented in the user file */
}

/**
  * @brief  GFXTIM Absolute line counter compare 2 callback.
  * @param  hgfxtim GFXTIM handle.
  * @retval None.
  */
__weak void HAL_GFXTIM_AbsoluteTimer_ALCC2Callback(GFXTIM_HandleTypeDef *hgfxtim)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hgfxtim);
  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_GFXTIM_AbsoluteTimer_ALCC2Callback could be implemented in the user file */
}

/**
  * @brief  GFXTIM Absolute line counter overflow callback.
  * @param  hgfxtim GFXTIM handle.
  * @retval None.
  */
__weak void HAL_GFXTIM_AbsoluteTimer_ALCOFCallback(GFXTIM_HandleTypeDef *hgfxtim)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hgfxtim);
  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_GFXTIM_AbsoluteTimer_ALCOFCallback could be implemented in the user file */
}

/**
  * @}
  */

/** @defgroup GFXTIM_Exported_Functions_Group4 Relative Timer functions
  * @brief    Clock Generator functions
  *
@verbatim
  ==============================================================================
                        ##### Relative Timer functions #####
  ==============================================================================
    [..]  This section provides functions allowing to :
      (+) Configure a relative timer.
      (+) Start a relative timer counter.
      (+) Stop a relative timer counter.
      (+) Force a relative timer counter reload.
      (+) Set a relative timer reload value.
      (+) Get a relative timer counter value.

@endverbatim
  * @{
  */

/**
  * @brief  This function configures a Relative Timer.
  * @param  hgfxtim GFXTIM handle.
  * @param  pRelativeTimerConfig pointer to a GFXTIM_RelativeTimerConfigTypeDef structure that
  *         contains relative timer comparators and counters values.
  * @param  RelativeTimer Relative Timer identifier
  *         This parameter can be a value of @ref GFXTIM_RelativeTimer.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_RelativeTimer_Config(GFXTIM_HandleTypeDef *hgfxtim,
                                                  const GFXTIM_RelativeTimerConfigTypeDef *pRelativeTimerConfig,
                                                  uint32_t RelativeTimer)
{
  HAL_StatusTypeDef status = HAL_OK;

  if ((hgfxtim == NULL) || (pRelativeTimerConfig == NULL))
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameters */
    assert_param(IS_GFXTIM_ALL_INSTANCE(hgfxtim->Instance));
    assert_param(IS_GFXTIM_RELATIVE_FRAME_VALUE(pRelativeTimerConfig->AutoReloadValue));
    assert_param(IS_GFXTIM_RELATIVE_FRAME_VALUE(pRelativeTimerConfig->CounterMode));
    assert_param(IS_GFXTIM_INTERRUPT(pRelativeTimerConfig->ReloadInterrupt));
    assert_param(IS_GFXTIM_RELATIVE_TIMER(RelativeTimer));

    if (hgfxtim->State == HAL_GFXTIM_STATE_READY)
    {
      if (RelativeTimer == GFXTIM_RELATIVE_TIMER1)
      {
        /* Set RFC1 auto reload */
        MODIFY_REG(hgfxtim->Instance->RFC1RR, GFXTIM_RFC1RR_FRAME,
                   pRelativeTimerConfig->AutoReloadValue << GFXTIM_RFC1RR_FRAME_Pos);

        /* Set relative timer mode */
        MODIFY_REG(hgfxtim->Instance->TCR, GFXTIM_TCR_RFC1CM,
                   (pRelativeTimerConfig->CounterMode << GFXTIM_TCR_RFC1CM_Pos));

        /* Set relative timer 1 interrupt */
        MODIFY_REG(hgfxtim->Instance->IER, GFXTIM_IER_RFC1RIE_Msk,
                   (pRelativeTimerConfig->ReloadInterrupt << GFXTIM_IER_RFC1RIE_Pos));
      }
      else
      {
        /* Set RFC2 auto reload */
        MODIFY_REG(hgfxtim->Instance->RFC2RR, GFXTIM_RFC2RR_FRAME,
                   pRelativeTimerConfig->AutoReloadValue << GFXTIM_RFC2RR_FRAME_Pos);

        /* Set relative timer mode */
        MODIFY_REG(hgfxtim->Instance->TCR, GFXTIM_TCR_RFC2CM,
                   (pRelativeTimerConfig->CounterMode << GFXTIM_TCR_RFC2CM_Pos));

        /* Set relative timer 2 interrupt */
        MODIFY_REG(hgfxtim->Instance->IER, GFXTIM_IER_RFC2RIE_Msk,
                   (pRelativeTimerConfig->ReloadInterrupt << GFXTIM_IER_RFC2RIE_Pos));
      }
    }
    else
    {
      status = HAL_ERROR;
    }
  }

